GHB2/src/Catalogs/гхб_СлужебныеЗначения/гхб_СлужебныеЗначения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>гхб_СлужебныеЗначения</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>Администрирование</name>
      <description>Администрирование</description>
    </items>
    <items>
      <name>МобильнаяСвязь</name>
      <description>Мобильная связь</description>
    </items>
    <items>
      <name>ОбменДанными</name>
      <description>Обмен данными</description>
    </items>
    <items>
      <name>Помещения</name>
      <description>Помещения</description>
    </items>
    <items>
      <name>Пропуска</name>
      <description>Пропуска</description>
    </items>
    <items>
      <name>ПутиКФайлам</name>
      <description>Пути к файлам</description>
    </items>
    <items>
      <name>СервисДеск</name>
      <description>Сервис деск</description>
    </items>
    <items>
      <name>ЭлектроннаяПочта</name>
      <description>Электронная почта</description>
    </items>
  </predefined>
  <attributes>
    <name>Значение</name>
    <type>
      <types>Boolean</types>
      <types>String</types>
      <types>Date</types>
      <types>Number</types>
      <types>DocumentRef</types>
      <types>CatalogRef</types>
      <numberQualifiers>
        <precision>20</precision>
        <scale>7</scale>
      </numberQualifiers>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗначениеСтрокаНеограничена</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:Catalog>

GHB2/src/Catalogs/гхб_СлужебныеЗначения/ManagerModule.bsl
Функция ВернутьЗначениеЭлементаСправочника(_Элемент, _ЗначениеСтрокаНеограничена = Ложь) Экспорт 
	
	Запрос = Новый Запрос();
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	гхб_СлужебныеЗначения.Значение КАК Значение,
	|	гхб_СлужебныеЗначения.ЗначениеСтрокаНеограничена КАК ЗначениеСтрокаНеограничена
	|ИЗ
	|	Справочник.гхб_СлужебныеЗначения КАК гхб_СлужебныеЗначения
	|ГДЕ
	|	гхб_СлужебныеЗначения.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", _Элемент);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Возврат ?(Выборка.Следующий(), ?(_ЗначениеСтрокаНеограничена, Выборка.ЗначениеСтрокаНеограничена, Выборка.Значение), Неопределено);
	
КонецФункции
